# Hello everyone, Welcome to my Channel. 

# Today I am going to show you how to select columns using kind of SQL like operator. 

# I never seen such a fantastic option in other programming languages.

# there are different ways to select columns in Pandas such as [] or . notation.

In [7]:
import pandas as pd

In [8]:
df=pd.read_csv('http://bit.ly/drinksbycountry')

In [9]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

# lets select the column using . notation

In [10]:
df.country.head()

0    Afghanistan
1        Albania
2        Algeria
3        Andorra
4         Angola
Name: country, dtype: object

# if you want to select multiple columns, then use [] method.

In [12]:
df[['country','continent','wine_servings']].head()

       country continent  wine_servings
0  Afghanistan      Asia              0
1      Albania    Europe             54
2      Algeria    Africa             14
3      Andorra    Europe            312
4       Angola    Africa             45

# lets get into the topic.

# lets say we want to select the columns which have 's' in it.

In [13]:
df.filter(regex='s',axis='columns').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

# its really cool. it is fetching only columns have 's' in it.

# lets select multiple columns using filter method.

In [14]:
df.filter(items=['country','continent','wine_servings']).head()

       country continent  wine_servings
0  Afghanistan      Asia              0
1      Albania    Europe             54
2      Algeria    Africa             14
3      Andorra    Europe            312
4       Angola    Africa             45

In [ ]:
#this is also cool.

# thats all my friends. hope you liked the video. 

# Please do subscribe and like the video. it will make me to post more videos like this.

# Thanks for watching.